
namespace Zhengyan.Lunar.EightChar;

public class BoneWeight
{
    public double YearWeight { get; set; }
    public double MonthWeight { get; set; }
    public double DayWeight { get; set; }
    public double HourWeight { get; set; }

    public double TotalWeight => Math.Round(YearWeight + MonthWeight + DayWeight + HourWeight, 2);

    override public string ToString()
    {
        return "【年：" + YearWeight + "两】" +
               "【月：" + MonthWeight + "两】" +
               "【日：" + DayWeight + "两】" +
               "【时：" + HourWeight + "两】" +
               "【总重：" + TotalWeight + "两】";
    }

}

public static class WeighingBoneWeight
{
    #region Liang
    static double[] YearWeights = //from 1924 to 1984
    {
            1.2, 0.9, 0.6, 0.7, 1.2, 0.5, 0.9, 0.8, 0.7, 0.8, 1.5, 0.9,
            1.6, 0.8, 0.8, 1.9, 1.2, 0.6, 0.8, 0.7, 0.5, 1.5, 0.6, 1.6,
            1.5, 0.7, 0.9, 1.2, 1.0, 0.7, 1.5, 0.6, 0.5, 1.4, 1.4, 0.9,
            0.7, 0.7, 0.9, 1.2, 0.8, 0.7, 1.3, 0.5, 1.4, 0.5, 0.9, 1.7,
            0.5, 0.7, 1.2, 0.8, 0.8, 0.6, 1.9, 0.6, 0.8, 1.6, 1.0, 0.7
        }; // 0.6 or 0.7?

    static double[] MonthWeights =
    {
            0.6, 0.7, 1.8, 0.9, 0.5, 1.6, 0.9, 1.5, 1.8, 0.8, 0.9, 0.5
        };

    static double[] DayWeights =
    {
            0.5, 1.0, 0.8, 1.5, 1.6,
            1.5, 0.8, 1.6, 0.8, 1.6,
            0.9, 1.7, 0.8, 1.7, 1.0,
            0.8, 0.9, 1.8, 0.5, 1.5,
            1.0, 0.9, 0.8, 0.9, 1.5,
            1.8, 0.7, 0.8, 1.6, 0.6
        };

    static double[] HourWeights = //starts from 0000
    {
            1.6, 0.6, 0.6, 0.7, 0.7, 1.0, 1.0, 0.9, 0.9, 1.6, 1.6, 1.0,
            1.0, 0.8, 0.8, 0.8, 0.8, 0.9, 0.9, 0.6, 0.6, 0.6, 0.6, 1.6
        };
    #endregion

    #region OriginalResult

    static string[] MaleOriginalResult =
    {
            "短命非业谓大空，平生灾难事重重。凶祸频临陷逆境，终世困苦事不成。",
            "身寒骨冷苦伶仃，此命推来生乞人。碌碌巴巴无度日，终年打拱过平年。",
            "此命推来骨自轻，求谋作事事难成。妻儿兄弟应难许，别作散人处他乡。",
            "此命推来福禄无，门庭困苦总难营。六亲骨肉皆无靠，流到他乡作老翁。",
            "此命推来祖业微，门庭营度似稀奇。六亲骨肉如冰炭，一生勤劳自把持。",
            "平生衣禄苦中求，独自经营事不休。离祖出门宜早计，晚来衣禄自无忧。",
            "一生作事少商量，难靠祖宗作主张。独马单枪空做去，早来晚岁部无长。",
            "一生作事似飘蓬，祖宗产业在梦中。若不过房并改姓，也当移徙两三通。",
            "初年运限未曾享，纵有功名在后底。须过四旬绕可上，移居改姓始为良。",
            "劳劳碌碌苦中求，东走西奔何日休。若使终身勤与俭，老来稍可免忧愁。",
            "忙忙碌碌苦中求，何日云开见日头。难得祖基家可立，中年衣食渐无忧。",
            "初年运蹇事难谋，渐有财源如水流。到得中年衣食旺，那时名利一齐来。",
            "早年做事事难成，百计徒劳枉费心。半世自如流水去，后来运到得黄金。",
            "此命福气果如何，僧道门中衣禄多。离祖出家方得妙，终朝拜佛念彌陀。",
            "平生福量不周全，祖业根基觉少传。营业生涯宜守旧，时来衣食胜从前。",
            "不须劳碌过平生，独自成家福不轻。早有福星常照命，任君行去百般成。",
            "此命般般事不成，弟兄少力自孤成。虽然祖业须微有，来得明时去得明。",
            "一生骨肉最清高，早入黄门姓名标。待看看将三十六，蓝袍脱去换红袍。",
            "此命终身运不穷，劳劳作事尽皆空。苦心竭力成家计，到得那时在梦中。",
            "生平衣禄是绵长，件件心中自主张。前面风霜多受过，后来必定享安康。",
            "此命推来事不同，为人能干略凡庸。中年还有逍遥福，不比前年运未通。",
            "得宽怀处且宽怀，何用双眉皱不开。若使中年命运济，那时名利一齐来。",
            "为人心性最聪明，作事轩昂近贵人。衣禄一生天数定，不须劳碌是丰享。",
            "来事由天莫苦求，须知福禄胜前途。当年财帛难如意，晚景欣然便不忧。",
            "名利推来竟若何，前途辛苦后奔波。命中难养男与女，骨肉扶持也不多。",
            "东西南北尽皆空，出姓移名更觉隆。衣禄无亏天数定，中年晚景一般同。",
            "此命推来旺末年，妻荣子贵自怡然。平生原有滔滔福，可有财源如水源。",
            "幼年运道未曾享，若是蹉跎再不兴。兄弟六亲皆无靠，一身事业晚年成。",
            "此命推来福不轻，自成自立耀门庭。从来富贵人亲近，使婢差奴过一生。",
            "为名为利终日劳，中年福禄也多遭。老来是有财星照，不比前番日下高。",
            "一世荣华事事通，不须劳碌自享丰。弟兄叔侄皆如意，家业成时福禄宏。",
            "一世享通事事能，不须劳思自然能。家族欣然心皆好，家业丰享自称心。",
            "此格推来气像真，兴家发达在其中。一生福禄安排家，欲是人间一富翁。",
            "此命推来厚且清，诗画满腹看功成。丰衣足食自然稳，正是人间有福人。",
            "走马扬鞭争名利，少年做事费筹谋。一朝福禄源源至，富贵荣华耀六亲。",
            "此格推来礼义通，一生福禄用无穷。甜酸苦辣皆尝过，财源滚滚稳且丰。",
            "福禄丰盈万事全，一生荣耀显双亲。名扬威振人钦敬，处世逍遥似遇春。",
            "平生福禄自然来，名利双全福禄偕。雁塔题名为贵客，紫袍玉带走金阶。",
            "细推此格妙且清，必定财高礼义通。甲第之中应有分，扬鞭走马显威荣。",
            "一朝金榜快题名，显祖荣宗立大功。衣食定然原裕足，田园财帛更丰盛。",
            "不作朝中金榜客，定为世上一财翁。聪明天赋经书熟，名显高科自是荣。",
            "此命推来福不穷，读书必定显亲宗。紫衣金带为卿相，富贵荣华皆可同。",
            "命主为官福禄长，得来富贵定非常。名题雁塔传金榜，定中高科天下扬。",
            "此格威权不可挡，紫袍金带坐高望。荣华富贵虽能及，积玉堆金满储仓。",
            "细推此命福不轻，安国安邦极品人。文纷雕梁徽富贵，威声照耀四方闻。",
            "此格人间一福人，堆金积玉满堂春。从来富贵由天定，正勿垂绅谒圣君。",
            "此命生来福自宏，田园家业最高隆。平生衣禄丰盈足，一世荣华万事通。",
            "富贵由大莫苦求，万金家计不须谋。十年不比前番事，祖业根基水上舟。",
            "君是人间前禄星，一生富贵众人钦。纵然福禄由天定，安享荣华过一生。",
            "此命推来福不轻，不须愁虑苦劳心。一生天定衣与禄，富贵荣华主一生。",
            "此命生来大不同，公侯卿相在其中。一生自有逍遥福，富贵荣华极品隆。",
            "此命推来天下隆，必定人间一主公。富贵荣华数不尽，定为乾坤一蛟龙。",
       };

    static string[] FemaleOriginalResult =
    {
            "生身此命运不通，乌云盖月黑朦胧。莫向故园载花木，可来幽地种青松。",
            "女命孤冷独凄身，此身推来路乞人。操心烦恼难度日，一生痛苦度光阴。",
            "女命生来轻薄人，营谋事作难称心。六亲骨肉亦无靠，奔走劳碌困苦门。",
            "女命推来福禄无，治家艰难辛苦多。丈夫儿女不亲爱，奔走他乡作游姑。",
            "此命一身八字低，家庭艰辛多苦妻。娘家亲友冷如炭，一生勤劳多忧眉。",
            "平生依禄但苦求，两次配夫带忧愁。咸酸苦辣他偿过，晚年衣食本无忧。",
            "此格做事单独强，难告夫君作主张。心问口来口问心，晚景衣禄宜自生。",
            "女命生来八字轻，为善作事也无因。你把别人当亲生，别人对你假殷情。",
            "花支艳来硬性身，自奔自力不求人。若问求财方可止，在苦有甜度光阴。",
            "女命推来比郎强，婚姻大事碍无障。中年走过坎坷地，末年渐经行前强。",
            "早年行运在忙头，劳碌奔波苦勤求。费力劳心把家立，后来晚景名忧愁。",
            "时逢运来带吉神，从有凶星转灰尘。真变假来假成真，结拜弟妹当亲生。",
            "初限命中有变化，中年可比树落花。勤俭持家难度日，晚年成业享荣华。",
            "矮巴勾枣难捞枝，看破红尘最相宜。谋望求财空费力，婚姻三娶两次离。",
            "女子走冰怕冰薄，出行交易受残霜。婚姻周郎休此意，官司口舌须相加。",
            "忧悉常锁两眉间，家业挂心不等闲。从今以后防口角，任意行移不相关。",
            "此命推来费运多，若作摧群受折磨。山路崎岖吊下耳，左插右安心难留。",
            "凤鸣岐山四方扬，女命逢此大吉昌。走失夫君音信有，晚年衣禄财盈箱。",
            "女命推来运未能，劳碌奔波一场空。好似俊鸟在笼锁，中年未限凄秋风。",
            "月令崎岖运不良，千辛万苦受煎熬。女身受得多苦难，晚年福禄比密甜。",
            "此命推来一般艰，女子为人很非凡。中年逍遥多自在，晚年更比中年超。",
            "杜井破废已多年，今有泉水出来鲜。资生济竭人称美，中运来转喜安然。",
            "推车靠涯道路通，女名求财也无穷。婚姻出配无阻碍，疾病口舌离身躬。",
            "夜梦金银醒来空，立志谋业运不通。婚姻难成交易散，夫君趟失未见踪。",
            "女命终身驳杂多，六亲骨肉不相助。命中男女都难养，劳碌辛苦还奔波。",
            "孤舟行水离沙滩，离乡出外早过家。是非口舌皆无碍，婚姻合配紫微房。",
            "时来运转喜开颜，多年枯木逢春花。枝叶重生多茂盛，凡人见得都赞夸。",
            "一朵鲜花镜中开，看着极好取不来。劝你休把镜花想，此命推来主可癫。",
            "一生为人福宏名，心兹随君显门庭。容貌美丽惹人爱，银钱富足万事成。",
            "马氏太公不相和，好命逢此忧凝多。恩人无义反为仇，是非平地起风波。",
            "肥羊一群入出场，防虎逢之把口张。适口充饥心欢喜，女命八字大吉昌。",
            "顺风行舟扯起帆，上天又助一顺风。不用费力逍遥去，任意顺行大亨通。",
            "此命相貌眉目清，文武双全功名成。一生衣禄皆无缺，可算世上积福人。",
            "运开满腹好文章，谋事求财大吉祥。出行交易多得稳，到处亨通姓名扬。",
            "发政旅仁志量高，女命求财任他乡。交舍婚姻多有意，无君出外有音耗。",
            "明珠辉吐离埃来，女有口有清散开。走失郎君当两归，交易有成永无灾。",
            "游鱼戏水被网惊，踊身变化入龙门。三根杨柳垂金钱，万朵桃花显价能。",
            "此命推来转悠悠，时运未来莫强求。幸得今日重反点，自有好运在后头。",
            "雨雪载途活泥泞，交易不安难出生。疾病还拉婚姻慢，谋望求财事难寻。",
            "女命八字喜气和，谋事求财吉庆多。口舌渐消疾病少，夫君走别归老窠。",
            "缘木求鱼事多难，虽不得鱼无害反。若是行险弄巧地，事不遂心枉安凡。",
            "指日高升气象新，走失待人有信音。好命遇事遂心好，伺病口舌皆除根。",
            "五官脱运难抬头，妇命须当把财求。交易少行有人助，一生衣禄不须愁。",
            "俊鸟曾得出胧中，脱离为难显威风。一朝得意福力至，东南西北任意通。",
            "女命推来福非轻，兹善为事受人敬。天降文王开基业，八百年来富贵门。",
            "时来运转闺阁楼，贤德淑女君子求。击鼓乐之大吉庆，女命逢此喜悠悠。",
            "乱丝无头定有头，碰得亲事暂折磨。交易出行无好处，谋事求财心不遂。",
            "水底明月不可捞，女命早限运未高。交易出行难获利，未运终得渐见好。",
            "太公封祖不非凡，女子求财稳如山。交易合伙多吉庆，疾病口角遗天涯。",
            "本命推断喜气新，恰遇郎君金遂心。坤身来交正当运，富贵衣禄乐平生。",
            "此命推来宏运交，不须再愁苦劳难。一生身有衣禄福，安享荣华胜班超。",
       };
    #endregion

    #region Functions

    public static BoneWeight GetBoneWeight(int year, int day, int month, int hour)
    {
        BoneWeight result = new BoneWeight();

        // year
        year = year - 1864;

        while (year < 0)
            year += 60;

        while (year > 60)
            year -= 60;

        result.YearWeight = YearWeights[year];

        // month
        result.MonthWeight = MonthWeights[month - 1];

        // day
        result.DayWeight = DayWeights[day - 1];

        // time
        result.HourWeight = HourWeights[hour];

        return result;
    }

    public static BoneWeight GetBoneWeight(this Solar solar)
    {
        return GetBoneWeight(solar.Lunar);
    }

    public static BoneWeight GetBoneWeight(this Lunar lunar)
    {
        return GetBoneWeight(lunar.Year, lunar.Day, lunar.Month, lunar.Hour);
    }

    /// <summary>
    /// 获取称骨歌
    /// </summary>
    /// <param name="boneWeight">骨重</param>
    /// <param name=”gender“>性别：1男，0女</param>
    /// <returns>称骨歌</returns>
    public static string GetComment(this BoneWeight boneWeight, int gender = 0)
    {
        int index = Convert.ToInt32((boneWeight.TotalWeight - 2.1) * 10);
        if (gender == 0)
        {
            if (index < 0 || index >= FemaleOriginalResult.Length)
                return "骨重不在范围内";
            return FemaleOriginalResult[index];
        }
        else
        {
            if (index < 0 || index >= MaleOriginalResult.Length)
                return "骨重不在范围内";
            return MaleOriginalResult[index];
        }
    }

    #endregion
}